{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_1x1_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_3x3_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_3x3_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_3x3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3_2_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_3x3_2_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_3x3_2_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_3x3_2_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_3x3_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_3x3_3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_3x3_3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3a_avg_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_pool_proj", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3a_pool_proj_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_pool_proj_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_3a_concat", 
      "attrs": {"num_args": "4"}, 
      "inputs": [[34, 0, 0], [50, 0, 0], [74, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3a_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_1x1_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_1x1_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_1x1_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_1x1_up_prob", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-1, 256, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[84, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_1x1_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_3x3_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_3x3_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_3x3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3_2_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_3x3_2_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_3x3_2_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_3x3_2_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 1], [133, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_3x3_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_3x3_3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_3x3_3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3b_avg_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_pool_proj", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3b_pool_proj_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 1], [150, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_pool_proj_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_3b_concat", 
      "attrs": {"num_args": "4"}, 
      "inputs": [[103, 0, 0], [119, 0, 0], [143, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3b_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_1x1_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_1x1_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_1x1_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_1x1_up_prob", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1, 320, 1, 1)"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[153, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3c_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3c_3x3_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0], [169, 0, 1], [170, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3c_3x3_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3c_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "160", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3c_3x3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0], [177, 0, 1], [178, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3c_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3c_3x3_2_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[164, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_reduce_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3c_3x3_2_reduce_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0], [184, 0, 0], [185, 0, 1], [186, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3c_3x3_2_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3c_3x3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3c_3x3_2_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 1], [194, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3c_3x3_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3c_3x3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3c_3x3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_3c_3x3_3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0], [201, 0, 1], [202, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3c_3x3_3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3c_pool", 
      "attrs": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_3c_concat", 
      "attrs": {"num_args": "3"}, 
      "inputs": [[180, 0, 0], [204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3c_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3c_1x1_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
