{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx1_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx1_conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx1_conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv2_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv2_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx1_conv2_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx1_conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx1_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_conv3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx1_conv3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "seresx1_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx1_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx1_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx1_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx1_up_sigmoid", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-1, 256, 1, 1)"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[48, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_match_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx1_match_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx1_match_conv_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_match_conv_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_match_conv_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx1_match_conv_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx1_match_conv_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "seresx1", 
      "inputs": [[59, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx2_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx2_conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx2_conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv2_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv2_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx2_conv2_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx2_conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx2_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_conv3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx2_conv3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "seresx2_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx2_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx2_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx2_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx2_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx2_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx2_up_sigmoid", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1, 256, 1, 1)"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[91, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "seresx2", 
      "inputs": [[68, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx3_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx3_conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx3_conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv2_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv2_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx3_conv2_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx3_conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx3_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_conv3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx3_conv3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "seresx3_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx3_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx3_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx3_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx3_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx3_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx3_up_sigmoid", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(-1, 256, 1, 1)"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[127, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "seresx3", 
      "inputs": [[104, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx4_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx4_conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx4_conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx4_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv2_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv2_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx4_conv2_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 1], [154, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx4_conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx4_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_conv3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx4_conv3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0], [161, 0, 1], [162, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "seresx4_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx4_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx4_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx4_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx4_up_sigmoid", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(-1, 512, 1, 1)"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3", 
      "inputs": [[163, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_match_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx4_match_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[140, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx4_match_conv_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_match_conv_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_match_conv_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx4_match_conv_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx4_match_conv_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0], [179, 0, 1], [180, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "seresx4", 
      "inputs": [[174, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx4_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx5_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx5_conv1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0], [188, 0, 1], [189, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx5_conv1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx5_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv2_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv2_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx5_conv2_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 1], [197, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx5_conv2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx5_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv3_bn_gamma", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv3_bn_beta", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_conv3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seresx5_conv3_bn", 
      "attrs": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0], [203, 0, 0], [204, 0, 1], [205, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "seresx5_global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seresx5_down_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seresx5_down_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seresx5_down", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seresx5_down_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "null", 
