{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res1_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res1_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res1_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res1_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res1_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res1_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res1_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res1_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res1_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res1_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res1_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res1_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res1_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res1_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res1_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res1", 
      "inputs": [[9, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res2_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res2_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res2_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res2_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res2_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res2_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res2_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res2_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2", 
      "inputs": [[26, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3_match_conv_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3_match_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3_match_conv_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_match_conv_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_match_conv_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_match_conv_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res3_match_conv_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res3_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[43, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res3_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res3_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res3_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3", 
      "inputs": [[50, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res4_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res4_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res4_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res4_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res4_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res4_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res4_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res4_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res4_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res4_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res4", 
      "inputs": [[67, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res4_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res5_match_conv_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res5_match_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res5_match_conv_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_match_conv_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_match_conv_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_match_conv_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res5_match_conv_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res5_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res5_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[84, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res5_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res5_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 1], [97, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res5_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res5_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res5_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res5_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res5_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res5_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 1], [105, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res5", 
      "inputs": [[91, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res5_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res6_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res6_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res6_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res6_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res6_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res6_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res6_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0], [112, 0, 0], [113, 0, 1], [114, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res6_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res6_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res6_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res6_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res6_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res6_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res6_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res6_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0], [121, 0, 1], [122, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res6", 
      "inputs": [[108, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res6_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res7_match_conv_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res7_match_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res7_match_conv_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_match_conv_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_match_conv_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_match_conv_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res7_match_conv_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res7_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res7_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[125, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res7_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res7_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0], [137, 0, 1], [138, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res7_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res7_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res7_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res7_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res7_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res7_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res7", 
      "inputs": [[132, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res7_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res8_conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res8_conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res8_conv1_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res8_conv1_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res8_conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res8_conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res8_conv1_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 1], [155, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res8_conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res8_conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res8_conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res8_conv2_bn_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res8_conv2_bn_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res8_conv2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res8_conv2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res8_conv2_bn", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 1], [163, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res8", 
      "inputs": [[149, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res8_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool", 
      "attr": {
        "cudnn_off": "False", 
        "global_pool": "True", 
        "kernel": "(1, 1)", 
        "pool_type": "avg", 
        "pooling_convention": "full"
      }, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "classifier_weight", 
      "attr": {"num_hidden": "1000"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "classifier_bias", 
      "attr": {"num_hidden": "1000"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "classifier", 
      "attr": {"num_hidden": "1000"}, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    10, 
    12, 
    13, 
    14, 
    15, 
    18, 
    20, 
    21, 
    22, 
    23, 
    27, 
    29, 
    30, 
    31, 
    32, 
    35, 
    37, 
    38, 
    39, 
    40, 
    44, 
    46, 
    47, 
    48, 
    49, 
    51, 
    53, 
    54, 
    55, 
    56, 
    59, 
    61, 
    62, 
    63, 
    64, 
    68, 
    70, 
    71, 
    72, 
    73, 
    76, 
    78, 
    79, 
    80, 
    81, 
    85, 
    87, 
    88, 
    89, 
    90, 
    92, 
    94, 
    95, 
    96, 
    97, 
    100, 
    102, 
    103, 
    104, 
    105, 
    109, 
    111, 
    112, 
    113, 
    114, 
    117, 
    119, 
    120, 
    121, 
    122, 
    126, 
    128, 
    129, 
    130, 
    131, 
    133, 
    135, 
    136, 
    137, 
    138, 
    141, 
    143, 
    144, 
    145, 
    146, 
    150, 
    152, 
    153, 
    154, 
    155, 
    158, 
    160, 
    161, 
    162, 
    163, 
    169, 
    170, 
    172
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    202, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    212, 
    213, 
    214
  ], 
  "heads": [[173, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1200]}
}