{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_match_conv_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_match_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_match_conv_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_match_conv_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_match_conv_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_match_conv_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air1_match_conv_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv1_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_conv1_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv1_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv1_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv1_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv1_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air1_conv1_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air1_conv1_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv1_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_conv1_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_conv2_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air1_conv2_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air1_conv2_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_conv2_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_2_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_2_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air1_conv2_2_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air1_conv2_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv2_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_conv2_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "air1_concat", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[26, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_concat_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_concat_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_concat_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_concat_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air1_concat_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air1_concat_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv3_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air1_conv3", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air1_conv3_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv3_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air1_conv3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air1_conv3_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "air1_eletwise", 
      "inputs": [[16, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "air1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv1_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air2_conv1_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv1_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv1_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv1_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv1_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air2_conv1_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air2_conv1_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv1_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air2_conv1_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air2_conv2_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air2_conv2_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air2_conv2_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air2_conv2_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_2_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_2_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air2_conv2_2_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 1], [84, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air2_conv2_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv2_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air2_conv2_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "air2_concat", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[70, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_concat_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_concat_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_concat_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_concat_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air2_concat_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 1], [93, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air2_concat_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv3_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air2_conv3", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air2_conv3_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv3_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air2_conv3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air2_conv3_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "air2_eletwise", 
      "inputs": [[60, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "air2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv1_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air3_conv1_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv1_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv1_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv1_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv1_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air3_conv1_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air3_conv1_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv1_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air3_conv1_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air3_conv2_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air3_conv2_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air3_conv2_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air3_conv2_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_2_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_2_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air3_conv2_2_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air3_conv2_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv2_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air3_conv2_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "air3_concat", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[114, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_concat_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_concat_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_concat_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_concat_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air3_concat_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air3_concat_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv3_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air3_conv3", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air3_conv3_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv3_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air3_conv3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air3_conv3_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0], [144, 0, 1], [145, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "air3_eletwise", 
      "inputs": [[104, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "air3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_match_conv_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_match_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_match_conv_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_match_conv_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_match_conv_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_match_conv_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air4_match_conv_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 1], [154, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv1_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_conv1_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[148, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv1_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv1_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv1_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv1_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air4_conv1_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 1], [161, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air4_conv1_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv1_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_conv1_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_conv2_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[148, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air4_conv2_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air4_conv2_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_conv2_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_2_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_2_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air4_conv2_2_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [178, 0, 1], [179, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air4_conv2_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv2_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_conv2_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "air4_concat", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[165, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_concat_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_concat_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_concat_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_concat_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air4_concat_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0], [187, 0, 1], [188, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air4_concat_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv3_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air4_conv3", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air4_conv3_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv3_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air4_conv3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air4_conv3_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0], [194, 0, 0], [195, 0, 1], [196, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "air4_eletwise", 
      "inputs": [[155, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "air4_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air5_conv1_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air5_conv1_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air5_conv1_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air5_conv1_1_bn_beta", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air5_conv1_1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "air5_conv1_1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "air5_conv1_1_bn", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0], [203, 0, 0], [204, 0, 1], [205, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "air5_conv1_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air5_conv1_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air5_conv1_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air5_conv2_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "air5_conv2_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[199, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "air5_conv2_1_bn_gamma", 
      "attr": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
