{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_3x3_s2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_3x3_s2_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3x3_s1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_3x3_s1_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3x3_s1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_3x3_s1_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_3x3_s2", 
      "attrs": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3x3_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv4_relu_3x3_reduce", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_3x3_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv4_relu_3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_3x3_s2", 
      "attrs": {
        "cudnn_off": "False", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_1x1_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_5x5_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_5x5_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_5x5_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_5x5", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_5x5_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_5x5_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_5x5_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_3x3_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_3x3_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_3x3_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3x3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_2_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_2_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3x3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_3x3_2_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 1], [88, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_3x3_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "ave_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_ave_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1x1_ave", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_ave_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_ave_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_ave_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1x1_ave_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_1x1_ave_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 1], [97, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_1x1_ave_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stem_concat", 
      "attrs": {"num_args": "4"}, 
      "inputs": [[50, 0, 0], [66, 0, 0], [90, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_1x1_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_1x1_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_1x1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_1x1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a1_1x1_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a1_3x3_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_3x3_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a1_3x3_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_3x3_2_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_3x3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a1_3x3_2_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_3x3_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_3x3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_3_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_3_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_3x3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a1_3x3_3_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 1], [147, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_3x3_3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_resnet_v2_a1_concat", 
      "attrs": {"num_args": "3"}, 
      "inputs": [[109, 0, 0], [125, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_up_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a1_up_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a1_up", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "0.170000001788"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "inception_resnet_v2_a1_residual_eltwise", 
      "inputs": [[101, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a1_residual_eltwise_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a2_1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_1x1_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_1x1_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_1x1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_1x1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a2_1x1_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 1], [163, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a2_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a2_3x3_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a2_3x3_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a2_3x3_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a2_3x3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a2_3x3_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [178, 0, 1], [179, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a2_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[183, 0, 0], [184, 0, 0], [185, 0, 0], [186, 0, 1], [187, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a2_3x3_2_reduce_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a2_3x3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a2_3x3_2_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0], [193, 0, 0], [194, 0, 1], [195, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a2_3x3_2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_resnet_v2_a2_3x3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_3_bn_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_3_bn_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_resnet_v2_a2_3x3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_resnet_v2_a2_3x3_3_bn", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0], [201, 0, 0], [202, 0, 1], [203, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_resnet_v2_a2_3x3_3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
