{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3x3_s2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_3x3_s2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_3x3_s2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3x3_s1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_s1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_3x3_s1_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_3x3_s1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3x3_s1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3x3_s1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_3x3_s1_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_3x3_s1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_stem1_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem1_3x3_s2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem1_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[24, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem1_3x3_s2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem1_3x3_s2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem1_3x3_s2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem1_3x3_s2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem1_3x3_s2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem1_3x3_s2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_stem1", 
      "attr": {"num_args": "2"}, 
      "inputs": [[25, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem2_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_reduce_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_reduce_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_reduce_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_reduce_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem2_3x3_reduce_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem2_3x3_reduce_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem2_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem2_3x3_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem2_3x3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem2_1x7_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_reduce_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_reduce_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_reduce_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_reduce_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem2_1x7_reduce_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem2_1x7_reduce_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_weight", 
      "attr": {
        "kernel": "(1, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem2_1x7", 
      "attr": {
        "kernel": "(1, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_1x7_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem2_1x7_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem2_1x7_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_7x1_weight", 
      "attr": {
        "kernel": "(7, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem2_7x1", 
      "attr": {
        "kernel": "(7, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_7x1_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_7x1_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_7x1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_7x1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem2_7x1_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem2_7x1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem2_3x3_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem2_3x3_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem2_3x3_2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem2_3x3_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_stem2", 
      "attr": {"num_args": "2"}, 
      "inputs": [[50, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem3_3x3_s2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_stem3_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_stem3_3x3_s2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem3_3x3_s2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem3_3x3_s2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_stem3_3x3_s2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_stem3_3x3_s2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 1], [89, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_stem3_3x3_s2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_stem3_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_stem3", 
      "attr": {"num_args": "2"}, 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_2_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_1x1_2", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_1x1_2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_1x1_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_reduce_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_reduce_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_reduce_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_reduce_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_3x3_reduce_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_3x3_reduce_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_3x3_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_3x3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_3x3_2_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_reduce_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_reduce_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_reduce_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_reduce_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_3x3_2_reduce_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_3x3_2_reduce_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_3x3_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_3x3_2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_3x3_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_3x3_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_3_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_3_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_3x3_3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_3x3_3_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_3x3_3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_a1_pool_ave", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a1_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a1_1x1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a1_1x1_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a1_1x1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_a1_concat", 
      "attr": {"num_args": "4"}, 
      "inputs": [[101, 0, 0], [117, 0, 0], [141, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_2_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_1x1_2", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_1x1_2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 1], [157, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a2_1x1_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_reduce_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_reduce_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_reduce_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_reduce_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_3x3_reduce_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a2_3x3_reduce_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_3x3_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a2_3x3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_3x3_2_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_reduce_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_reduce_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_reduce_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_reduce_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_3x3_2_reduce_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[177, 0, 0], [178, 0, 0], [179, 0, 0], [180, 0, 1], [181, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a2_3x3_2_reduce_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_3x3_2", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_2_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_3x3_2_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0], [188, 0, 1], [189, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a2_3x3_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_3x3_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_3_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_3_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_3_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_3x3_3_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_3x3_3_bn", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 1], [197, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_a2_3x3_3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_a2_pool_ave", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_a2_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_bn_gamma", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_bn_beta", 
      "attr": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_bn_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_a2_1x1_bn_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "inception_a2_1x1_bn", 
      "attr": {
        "eps": "0.001", 
